app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "updated_at" = ?, "view_count" = ? WHERE "articles"."id" = 1  [["updated_at", "2014-11-30 17:06:25.088760"], ["view_count", 3]]
SELECT  "articles".* FROM "articles"   ORDER BY "articles"."view_count" DESC LIMIT 3
---
	def show
		@article = Article.find(params[:id])

		@comment = Comment.new	#adding new comment in show Article (different than Rails officila tutorial)
		@comment.article_id = @article.id

		#why we aren’t using @article.comments.new?
		#if we do so, there is an extra empty comment at the end of the list of comments.
		#That is due to the fact that @article.comments.new has added the new Comment to the in-memory collection for the Article

	@article.view_count = @article.view_count.to_i + 1
	@article.save

	@view_count = @article.view_count

	@top_views = Article.order(view_count: :desc).take(3)		#sorting articles on view_count and take the first 3 records

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Text Articol 5. Eh, la sfarsit ce sa vezi?!"], ["created_at", "2014-11-26 17:05:59.122598"], ["title", "Articol 5"], ["updated_at", "2014-11-26 17:05:59.122598"]]
---
	def create
		@article = Article.new(article_params)

		#replaced with the above, after defining article_params method in the articles_helper.rb
		#@article = Article.new(params[:article])
			# this is the equivalent of
			#		@article = Article.new(
    	#			title: params[:article][:title],
    	#			body: params[:article][:body])

		@article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["image_content_type", "image/png"], ["image_file_name", "beast.png"], ["image_file_size", 27720], ["image_updated_at", "2014-11-28 15:32:43.770137"], ["updated_at", "2014-11-28 15:32:43.970252"]]
---
	def update
	  @article = Article.find(params[:id])
  	@article.update(article_params)