app/controllers/author_sessions_controller.rb

	def new
      if Author.count == 0 || current_user
---
SELECT COUNT(*) FROM "authors"