app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["author_name", ""], ["body", ""], ["created_at", "2014-11-27 12:36:33.653690"], ["updated_at", "2014-11-27 12:36:33.653690"]]
---
	def create
		@comment = Comment.new(comment_params)
		@comment.article_id = params[:article_id]
		@comment.save